# AddNewAssetAsColor Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyList..::..AddNewAssetAsColor Method
AssetPropertyList Class See Also
---
Adds a new AssetPropertyDouble4 property to the list containing a value matching the input color.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public void AddNewAssetAsColor(
	Color value
)
```

Visual Basic
---
```text
Public Sub AddNewAssetAsColor ( _
	value As Color _
)
```

Visual C++
---
```text
public:
void AddNewAssetAsColor(
	Color^ value
)
```

# ### Parameters
value
    Type: Autodesk.Revit.DB..::..Color The color value to add.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The asset property is not editable. |

# See Also
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace